import json
import psycopg2
import requests
import random


def processing():
    connection = psycopg2.connect(
        host = "localhost",
        database = "google_itc",
        user = "yeraly",
        password = "123",
        port = "5432"
    )
    cursor = connection.cursor()

    titles = [
    "ТехноВизион","ЭкоСфера","ИнноваЛаб","ГлобаТрейд","АвтоПрогресс","МедиаМагия","ФудФьюжн","ЗдоровьеВек","ФинансТех","ЭнергоСила","ТурбоТранс","ГринТек","СмартСистемс","АртВейв","ЭкоЛайф","ИнфоСтрим","МобилСолюшнс","ЭкоВизит","СтартАпИнсайт","ЛайфЛогикс","ГроуТек","КреативКоннект","ЭлектроСпринг","ДжойТек","СолнцеВерс","ИнтерАктивСайенс","ГлобалДайнамикс","КомпьютерКрафт","СпейсВейв","ТревелТренд","СиберНетворкс","Автоциклон","ДиджиталВизион","МедиаРайдер","АкселеКомм","ИнсайдТрек","МаркетМастер","Экоцентр","СайберДжен","ЗвездныйПуть","ЭффективТайм","Автоарт","СпортСтарс","ТрендЛинк","ГрандФьюжн","ИнтернетИнновации","СайенсЛаб","ЗдоровыйОбраз","ФудЛайн","ТриТрансформ","ВебМайндс","АрхитектурныеИдеи","СмартТек","АйТиПро","ГроуВейв","ФастФьюжн","ТелеКоннект","АвтоМастерс","СпейсКейп","СоциальныйКруг","ФьючерТрейд","ЗвездныйВетер","ЛогистикСолюшнс","ИнноваКонсалт","МаркетТренд","ВебВизион","ДиджиталДайнамикс","БизнесБридж","СайенсКоннект","ИнфоСпот","СпортСтайл","ТрейдМастер","СайберСпейс","ЭкоПрогресс","Автофокус","ГроуТрек","ТехноМаркет","СолнцеСистемс","ЭнергоКомм","ДиджиталДжой","МедиаФокус","ФудЛогистик","АйТиЛидерс","ТрендЛаб","ИнтернетИнсайд","СпейсКрафт","ЗвездаТрек","ЛайфСайенс","ГлобалКоннект","СоциальныйТренд","ФьючерИнновейшн","АрхитектурныйВизион","СмартСпот","ВебМастерс","СайенсПрофес","ИнфоЛайн","СпортВейв","ТрейдЛайн","СайберВизион","ЭкоСтар","АвтоКоннект","ГроуПрофес","ТехноСпринг","СолнцеЛайн","ЭнергоВейв","ДиджиталКрафт","МедиаФьюжн","ФудСфера","АйТиМастер","ТрендКонсалт","ИнтернетИдентити","СпейсПрофес","ЗвездныйСайенс","ЛайфПрогресс","ГлобалСпот","СоциальныйКомпас","ФьючерКоннект","АрхитектурныйМарш","СмартЛайф","ВебИнтеракт","СайенсИнновейшн","ИнфоКрафт","СпортЛогистик","ТрейдКрафт","СайберСфера",
]
    additional_roles = [
    "Главный маркетинговый директор", "Аналитик по данных", "Креативный директор", "Директор по кадровому управлению", "Специалист по клиентскому обслуживанию", "Финансовый директор", "Менеджер по продажам", "Системный архитектор", "Дизайнер интерфейсов", "Менеджер по социальным медиа", "Директор по корпоративным коммуникациям", "Специалист по качеству продукции", "Директор по стратегическому развитию", "Инженер по безопасности", "Аналитик по рыночным исследованиям", "Координатор мероприятий", "Директор по инфраструктуре", "Менеджер по закупкам", "Специалист по контенту", "Директор по деловым партнерствам",
]
    staff = random.randint(10,70)
    revenue = random.randint(10000000,700000000)
    salary = random.randint(100000, 700000)

    cursor.execute("CREATE TABLE IF NOT EXISTS company(\
        id SERIAL PRIMARY KEY,\
        title VARCHAR(125) DEFAULT NULL,\
        role VARCHAR(255) DEFAULT NULL,\
        staff INT DEFAULT NULL,\
        revenue BIGINT DEFAULT NULL,\
        salary BIGINT DEFAULT NULL)")
    
    cursor.execute("INSERT INTO company(title, role, staff, revenue, salary) VALUES (%s, %s, %s, %s, %s)",
        (
            random.choice(titles),
            random.choice(additional_roles),
            staff,
            revenue,
            salary
        )
        )
    
    connection.commit()
    cursor.close()
    connection.close()

def Run():
    for count in range(1,101):
        processing()
        print(f"Пользователь с номером {count} записан")

Run()